design.md
```mermaid
graph TD
    Begin_execution["Begin execution"] --> Stage_events["Stage events"]
    Begin_execution --> Stage_songs["Stage songs"]
    Stage_events --> Load_songplays_fact_table["Load songplays fact table"]
    Stage_songs --> Load_songplays_fact_table
    Load_songplays_fact_table --> Load_song_dim_table["Load song dim table"]
    Load_songplays_fact_table --> Load_user_dim_table["Load user dim table"]
    Load_songplays_fact_table --> Load_artist_dim_table["Load artist dim table"]
    Load_songplays_fact_table --> Load_time_dim_table["Load time dim table"]
    Load_song_dim_table --> Run_data_quality_checks["Run data quality checks"]
    Load_user_dim_table --> Run_data_quality_checks
    Load_artist_dim_table --> Run_data_quality_checks
    Load_time_dim_table --> Run_data_quality_checks
    Run_data_quality_checks --> End_execution["End execution"]
```
